CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
/*
 ADE7953ESP32.cpp - Simple library for operating the ADE7953 Single-Phase AC Line measurement IC over SPI for ESP32 Arduino Core
  Created by Umar Kazmi, Crystal Lai, and Michael Klopfer, Ph.D.
  Modified for ESP32 operation by Luis Contreras, 2018 with polish updates by M.J. Klopfer
  University of California, Irvine - California Plug Load Research Center (CalPlug)
  Released into the public domain.    Feb 22, 2019 - v1.0 (first final release)
*/

#include "Arduino.h"
#include "ADE7953ESP32.h"
#include "esp32-hal-spi.h"
//#define ADE7953_VERBOSE_DEBUG //This line turns on verbose debug via serial monitor (Normally off or //'ed).  Use sparingly and in a test program!  Turning this on can take a lot of memory!  This is non-specific and for all functions, beware, it's a lot of output!  Reported bytes are in HEX

spi_t * spy; //for ESP32


//******************Calibration Factors*************************
//NOTE  These are provided for convenience.  The decimalize(long input, float factor, float offset) function is used to do typecasting and conversion for SIGNED (2's compliment) reporting registers from long to float, but it can also provide linear calibration to returned values.  This is TOTALLY SEPARATE from the internal channel gain and offset corrections as well as the analog gain that can be set for each channel.  Based on our tests, the use of different board components in the filter and loading parts of this circuit can easily throw off calibration.  The values shown here will likely not work for you out of the box for you.  By far the safest thing is to use an identity such that gain (m) = 1 and offset (b)=0.  Then perform your own calibration in your user code.  You can do a pre-correction here then a post correction in your user code, but that gets confusing.  If you really want to use this capability, we recommend making sure you note in your user code these values as you will have to change your library (technically a fork) to update.  Please use the Excel calibration calculator provided to help you find the calibration values using a known source/load and meter to calibrate.  Remember if you change the analog gain or use any internal channel calibration functions on the ADE7953, this will adjust your calibration accordingly.

#define getPowerFactorA_m 1.0  //327.67 was a previous value used for gain
#define getPowerFactorA_b 0.0

#define getPowerFactorB_m 1.0  //327.67 was a previous value used for gain
#define getPowerFactorB_b 0.0

#define getPeriod_m 1.0
#define getPeriod_b 0.0

#define getVrms_m 1.0  //19090 was a previous value used for gain
#define getVrms_b 0.0

#define getIrmsA_m 1.0 //1327 was a previous value used for gain
#define getIrmsA_b 0.0

#define getIrmsB_m 1.0 //1327 was a previous value used for gain
#define getIrmsB_b 0.0

#define getInstApparentPowerA_m 1.0 //1.502 was a previous value used for gain
#define getInstApparentPowerA_b 0.0

#define getInstActivePowerB_m 1.0 //1.502 was a previous value used for gain
#define getInstActivePowerB_b 0.0

#define getInstReactivePowerA_m 1.0 
#define getInstReactivePowerA_b 0.0

#define getInstReactivePowerB_m 1.0 
#define getInstReactivePowerB_b 0.0





//******************************************************************************************



//*****************ADE7953 Register Value Constants*****************//
//The #define used to save space where functions are not invoked - list of full general commands for ADE7953, not all implemented

//8-bit Registers
#define SAGCYC_8 0x000 //SAGCYC, (R/W) Default: 0x00, Unsigned, Sag lines Cycle 
#define DISNOLOAD_8 0x001 //DISNOLOAD, (R/W) Default: 0x00, Unsigned, No-load detection disable* 
#define LCYCMODE_8 0x004 //LCYCMODE, (R/W) Default: 0x40, Unsigned, Line cycle accumulation mode configuration **
#define PGA_V_8 0x007 //PGA_V, (R/W) Default: 0x00, Unsigned, Voltage channel gain configuration (Bits[2:0])  
#define PGA_IA_8 0x008 //PGA_IA, (R/W) Default: 0x00, Unsigned, Current Channel A gain configuration (Bits[2:0])  
#define PGA_IB_8 0x009 //PGA_IB, (R/W) Default: 0x00, Unsigned, Current Channel B gain configuration (Bits[2:0]) 
#define WRITE_PROTECT_8 0x040 //WRITE_PROTECT, (R/W) Default: 0x00, Unsigned, Write protection bits (Bits[2:0]) 
#define LAST_OP_8 0x0FD //LAST_OP, (R/W) Default: 0x00, Unsigned, Contains the type (read or write) of the last successful communication (0x35 read 0xCA = write) 
#define LAST_RWDATA_8 0x0FF //LAST_RWDATA_8, (R/W) Default: 0x00, Unsigned, Contains the data from the last successful 8-bit register communication  
#define Version_8 0x702 //Version, (R/W) Default: N/A, Unsigned, Contains the silicon version number 
#define EX_REF_8 0x800 //EX_REF, (R/W) Default: 0x00, Unsigned, Reference input configuration:0 = internal 1 = external 

//*DISNOLOAD register

//**LCYCMODE register


//16-bit Registers
#define ZXTOUT_16 0x100 //ZXTOUT, (R/W) Default:0xFFFF, Unsigned,Zero-crossing timeout
#define LINECYC_16 0x101 //LINCYC, (R/W) Default:0x0000, Unsigned,Number of half line cycles for line cycle energy accumulation mode
#define CONFIG_16 0x102 //CONFIG, (R/W) Default:0x8004, Unsigned,Configuration register***
#define CF1DEN_16 0x103 //CF1DEN, (R/W) Default:0x003F, Unsigned,CF1 frequency divider denominator. When modifying this register, two sequential write operations must be performed to ensure that the write is successful. 
#define CF2DEN_16 0x104 //CF2DEN, (R/W) Default:0x003F, Unsigned,CF2 frequency divider denominator. When modifying this register, two sequential write operations must be performed to ensure that the write is successful. 
#define CFMODE_16 0x107 //CFMODE, (R/W) Default:0x0300, Unsigned, CF output selection */
#define PHCALA_16 0x108 //PHCALA, (R/W) Default:0x0000, Signed,Phase calibration register (Current Channel A). This register is in sign magnitude format. 
#define PHCALB_16 0x109 //PHCALB, (R/W) Default:0x0000, Signed,Phase calibration register (Current Channel B). This register is in sign magnitude format. 
#define PFA_16 0x10A //PFA, (R) Default:0x0000, Signed,Power factor (Current Channel A) 
#define PFB_16 0x10B //PFB, (R) Default:0x0000, Signed,Power factor (Current Channel B) 
#define ANGLE_A_16 0x10C //ANGLE_A, (R) Default:0x0000, Signed,Angle between the voltage input and the Current Channel A input 
#define ANGLE_B_16 0x10D //ANGLE_B, (R) Default:0x0000, Signed,Angle between the voltage input and the Current Channel B input 
#define Period_16 0x11E //Period, (R) Default:0x0000, Unsigned, Period register 
#define ALT_OUTPUT_16 0x110 //ALT_OUTPUT, (R/W) Default:0x0000, Unsigned,Alternative output functions**/
#define LAST_ADD_16 0x1FE //LAST_ADD, (R) Default:0x0000, Unsigned, Contains the address of the last successful communication 
#define LAST_RWDATA_16 0x1FF //LAST_RWDATA_16, (R) Default:0x0000, Unsigned,Contains the data from the last successful 16-bit register communication 
#define Reserved_16 0x120 //Reserved, (R/W) Default:0x0000, Unsigned,This register should be set to 30h to meet the performance specified in Table 1. To modify this register, it must be unlocked by setting Register Address 0xFE to 0xAD immediately prior. (16 bit)


//*** CONFIG register
//*/ CFMODE register
//**/ALT_OUTPUT register


