CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
#define Reserved2_24 0x291 //Reserved, (R/W) Default: 0x000000, Signed,This register should not be modified (24 bit)
#define Reserved2_32 0x391 //Reserved, (R/W) Default: 0x000000, Signed,This register should not be modified(32 bit)

#define BIRMSOS_24 0x292 //BIRMSOS, (R/W) Default: 0x000000, Unsigned, IRMS offset (Current Channel B)(24 bit)
#define BIRMSOS_32 0x392 //BIRMSOS, (R/W) Default: 0x000000, Unsigned,IRMS offset (Current Channel B)(32 bit)

#define Reserved3_24 0x293 //Reserved, (R/W) Default: 0x000000, Signed,This register should not be modified (24 bit)
#define Reserved3_32 0x393 //Reserved, (R/W) Default: 0x000000, Signed,This register should not be modified(32 bit)
#define Reserved4_24 0x294 //Reserved, (R/W) Default: 0x000000, Signed,This register should not be modified (24 bit)
#define Reserved4_32 0x394 //Reserved, (R/W) Default: 0x000000, Signed,This register should not be modified(32 bit)

#define BWATTOS_24 0x295 //BWATTOS, (R/W) Default: 0x000000, Unsigned, Active power offset correction (Current Channel B)(24 bit)
#define BWATTOS_32 0x395 //BWATTOS, (R/W) Default: 0x000000, Unsigned,Active power offset correction (Current Channel B)(32 bit)
#define BVAROS_24 0x296 //BVAROS, (R/W) Default: 0x000000, Unsigned,Reactive power offset correction (Current Channel B)(24 bit)
#define BVAROS_32 0x396 //BVAROS, (R/W) Default: 0x000000, Unsigned,Reactive power offset correction (Current Channel B)(32 bit)
#define BVAOS_24 0x297 //BVAOS, (R/W) Default: 0x000000, Unsigned, Apparent power offset correction (Current Channel B)(24 bit)
#define BVAOS_32 0x397 //BVAOS, (R/W) Default: 0x000000, Unsigned,Apparent power offset correction (Current Channel B)(32 bit)
#define LAST_RWDATA_24 0x2FF //LAST_RWDATA, (R) Default: 0x000000, Unsigned, Contains the data from the last successful 24-bit/32-bit register communication(24 bit)
#define LAST_RWDATA_32 0x3FF //LAST_RWDATA, (R) Default: 0x000000, Unsigned, Contains the data from the last successful 24-bit/32-bit register communication(32 bit)

//***************
/*
ADE7953 REGISTER DESCRIPTIONS

DISNOLOAD Register (Address 0x001)
Bits Bit Name Default Description
0 DIS_APNLOAD 0 1 = disable the active power no-load feature on Current Channel A and Current Channel B
1 DIS_VARNLOAD 0 1 = disable the reactive power no-load feature on Current Channel A and Current Channel B
2 DIS_VANLOAD 0 1 = disable the apparent power no-load feature on Current Channel A and Current Channel B

LCYCMODE Register (Address 0x004)
Bits Bit Name Default Description
0 ALWATT 0 0 = disable active energy line cycle accumulation mode on Current Channel A
1 = enable active energy line cycle accumulation mode on Current Channel A
1 BLWATT 0 0 = disable active energy line cycle accumulation mode on Current Channel B
1 = enable active energy line cycle accumulation mode on Current Channel B
2 ALVAR 0 0 = disable reactive energy line cycle accumulation mode on Current Channel A
1 = enable reactive energy line cycle accumulation mode on Current Channel A
3 BLVAR 0 0 = disable reactive energy line cycle accumulation mode on Current Channel B
1 = enable reactive energy line cycle accumulation mode on Current Channel B
4 ALVA 0 0 = disable apparent energy line cycle accumulation mode on Current Channel A
1 = enable apparent energy line cycle accumulation mode on Current Channel A
5 BLVA 0 0 = disable apparent energy line cycle accumulation mode on Current Channel B
1 = enable apparent energy line cycle accumulation mode on Current Channel B
6 RSTREAD 1 0 = disable read with reset for all registers
1 = enable read with reset for all registers

CONFIG Register (Address 0x102)
Bits Bit Name Default Description
0 INTENA 0 1 = integrator enable (Current Channel A)
1 INTENB 0 1 = integrator enable (Current Channel B)
2 HPFEN 1 1 = HPF enable (all channels)
3 PFMODE 0 0 = power factor is based on instantaneous powers, 1 = power factor is based on line cycle accumulation mode energies
4 REVP_CF 0 0 = REVP is updated on CF1, 1 = REVP is updated on CF2
5 REVP_PULSE 0 0 = REVP is high when reverse polarity is true, low when reverse polarity is false, 1 = REVP outputs a 1 Hz pulse when reverse polarity is true and is low when reverse polarity is false
6 ZXLPF 0 0 = ZX LPF is enabled, 1 = ZX LPF is disabled
7 SWRST 0 Setting this bit enables a software reset
8 CRC_ENABLE 0 0 = CRC is disabled, 1 = CRC is enabled
[10:9] Reserved 00 Reserved
11 ZX_I 0 0 = ZX_I is based on Current Channel A, 1 = ZX_I is based on Current Channel B
[13:12] ZX_EDGE 00 Zero-crossing interrupt edge selection
Setting               Edge Selection
00                    Interrupt is issued on both positive-going and negative-going zero crossing
01                    Interrupt is issued on negative-going zero crossing
10                    Interrupt is issued on positive-going zero crossing
11                    Interrupt is issued on both positive-going and negative-going zero crossing
14                    Reserved 0 Reserved
15                    COMM_LOCK 1 0 = communication locking feature is enabled, 1 = communication locking feature is disabled

CFMODE Register (Address 0x107)
Bits Bit Name Default Description
[3:0] CF1SEL 0000 Configuration of output signal on CF1 pin
Setting CF1 Output Signal Configuration
0000 CF1 is proportional to active power (Current Channel A)
0001 CF1 is proportional to reactive power (Current Channel A)
0010 CF1 is proportional to apparent power (Current Channel A)
0011 CF1 is proportional to IRMS (Current Channel A)
0100 CF1 is proportional to active power (Current Channel B)
0101 CF1 is proportional to reactive power (Current Channel B)
0110 CF1 is proportional to apparent power (Current Channel B)
0111 CF1 is proportional to IRMS (Current Channel B)
1000 CF1 is proportional to IRMS (Current Channel A) + IRMS (Current Channel B)
1001 CF1 is proportional to active power (Current Channel A) + active power (Current Channel B)
[7:4] CF2SEL 0000 Configuration of output signal on CF2 pin 
Setting              CF2 Output Signal Configuration
0000                 CF2 is proportional to active power (Current Channel A)
0001                 CF2 is proportional to reactive power (Current Channel A)
0010                 CF2 is proportional to apparent power (Current Channel A)
0011                 CF2 is proportional to IRMS (Current Channel A)
0100                 CF2 is proportional to active power (Current Channel B)
0101                 CF2 is proportional to reactive power (Current Channel B)
0110                 CF2 is proportional to apparent power (Current Channel B)
0111                 CF2 is proportional to IRMS (Current Channel B)
1000                 CF2 is proportional to IRMS (Current Channel A) + IRMS (Current Channel B)
1001                 CF2 is proportional to active power (Current Channel A) + active power(Current Channel B)
8 CF1DIS 1     0 = CF1 output is enabled, 1 = CF1 output is disabled
9 CF2DIS 1     0 = CF2 output is enabled, 1 = CF2 output is disabled

ALT_OUTPUT Register (Address 0x110)
Bits Bit Name Default Description
[3:0] ZX_ALT 0000 Configuration of ZX pin (Pin 1)
Setting 		ZX Pin Configuration
0000 			ZX detection is output on Pin 1 (default)
0001 			Sag detection is output on Pin 1
0010 			Reserved
0011 			Reserved
0100 			Reserved
0101 			Active power no-load detection (Current Channel A) is output on Pin 1
0110 			Active power no-load detection (Current Channel B) is output on Pin 1
0111 			Reactive power no-load detection (Current Channel A) is output on Pin 1
1000 			Reactive power no-load detection (Current Channel B) is output on Pin 1
1001 			Unlatched waveform sampling signal is output on Pin 1
1010 			IRQ signal is output on Pin 1
1011 			ZX_I detection is output on Pin 1
1100 			REVP detection is output on Pin 1
1101 			Reserved (set to default value)
111x 			Reserved (set to default value)
[7:4] ZXI_ALT 0000 Configuration of ZX_I pin (Pin 21)
Setting 		ZX_I Pin Configuration
0000 			ZX_I detection is output on Pin 21 (default)
0001 			Sag detection is output on Pin 21
0010 			Reserved
0011 			Reserved
0100 			Reserved
0101 			Active power no-load detection (Current Channel A) is output on Pin 21
0110 			Active power no-load detection (Current Channel B) is output on Pin 21
0111 			Reactive power no-load detection (Current Channel A) is output on Pin 21
1000 			Reactive power no-load detection (Current Channel B) is output on Pin 21
1001 			Unlatched waveform sampling signal is output on Pin 21
1010 			IRQ signal is output on Pin 21
1011 			ZX detection is output on Pin 21
1100 			REVP detection is output on Pin 21
1101 			Reserved (set to default value)
111x 			Reserved (set to default value)

[11:8] REVP_ALT 0000 Configuration of REVP pin (Pin 20)
Setting			REVP Pin Configuration
0000 			REVP detection is output on Pin 20 (default)
0001 			Sag detection is output on Pin 20
0010 			Reserved
0011 			Reserved
0100 			Reserved
0101 			Active power no-load detection (Current Channel A) is output on Pin 20
0110 			Active power no-load detection (Current Channel B) is output on Pin 20
0111 			Reactive power no-load detection (Current Channel A) is output on Pin 20
1000 			Reactive power no-load detection (Current Channel B) is output on Pin 20
1001 			Unlatched waveform sampling signal is output on Pin 20
1010 			IRQ signal is output on Pin 20
1011 			ZX detection is output on Pin 20
1100 			ZX_I detection is output on Pin 20
1101 			Reserved (set to default value)
111x 			Reserved (set to default value)

ACCMODE Register (Address 0x201 and Address 0x301)
Bits Bit Name Default Description
[1:0] AWATTACC 00 Current Channel A active energy accumulation mode
Setting Active Energy Accumulation Mode (Current Channel A)
	00 Normal mode
	01 Positive-only accumulation mode
	10 Absolute accumulation mode
	11 Reserved
[3:2] BWATTACC 00 Current Channel B active energy accumulation mode
Setting Active Energy Accumulation Mode (Current Channel B)
	00 Normal mode
	01 Positive-only accumulation mode
	10 Absolute accumulation mode
	11 Reserved
[5:4] AVARACC 00 Current Channel A reactive energy accumulation mode
Setting Reactive Energy Accumulation Mode (Current Channel A)
	00 Normal mode
	01 Antitamper accumulation mode
	10 Absolute accumulation mode
	11 Reserved
[7:6] BVARACC 00 Current Channel B reactive energy accumulation mode
Setting Reactive Energy Accumulation Mode (Current Channel B)
	00 Normal mode
	01 Antitamper accumulation mode
	10 Absolute accumulation mode
	11 Reserved
8 AVAACC 0 0 = Current Channel A apparent energy accumulation is in normal mode, 1 = Current Channel A apparent energy accumulation is based on IRMSA
9 BVAACC 0 0 = Current Channel B apparent energy accumulation is in normal mode, 1 = Current Channel B apparent energy accumulation is based on IRMSB
10 APSIGN_A 0 0 = active power on Current Channel A is positive, 1 = active power on Current Channel A is negative
11 APSIGN_B 0 0 = active power on Current Channel B is positive, 1 = active power on Current Channel B is negative
12 VARSIGN_A 0 0 = reactive power on Current Channel A is positive, 1 = reactive power on Current Channel A is negative
13 VARSIGN_B 0 0 = reactive power on Current Channel B is positive, 1 = reactive power on Current Channel B is negative
[15:14] Reserved 00 Reserved
16 ACTNLOAD_A 0 0 = Current Channel A active energy is out of no-load condition, 1 = Current Channel A active energy is in no-load condition
17 VANLOAD_A 0 0 = Current Channel A apparent energy is out of no-load condition, 1 = Current Channel A apparent energy is in no-load condition
18 VARNLOAD_A 0 0 = Current Channel A reactive energy is out of no-load condition, 1 = Current Channel A reactive energy is in no-load condition
19 ACTNLOAD_B 0 0 = Current Channel B active energy is out of no-load condition, 1 = Current Channel B active energy is in no-load condition
20 VANLOAD_B 0 0 = Current Channel B apparent energy is out of no-load condition, 1 = Current Channel B apparent energy is in no-load condition
21 VARNLOAD_B 0 0 = Current Channel B reactive energy is out of no-load condition, 1 = Current Channel B reactive energy is in no-load condition

*/

