CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
//Interrupt Configuration
//Note: For IRQENA Register (Address 0x22C and Address 0x32C)), each binary position of the 16- bit response has the following configuration options
//Bits Bit Name Description
//0 AEHFA Set to 1 to enable an interrupt when the active energy is half full (Current Channel A)
//1 VAREHFA Set to 1 to enable an interrupt when the reactive energy is half full (Current Channel A)
//2 VAEHFA Set to 1 to enable an interrupt when the apparent energy is half full (Current Channel A)
//3 AEOFA Set to 1 to enable an interrupt when the active energy has overflowed or underflowed (Current Channel A)
//4 VAREOFA Set to 1 to enable an interrupt when the reactive energy has overflowed or underflowed (Current Channel A)
//5 VAEOFA Set to 1 to enable an interrupt when the apparent energy has overflowed or underflowed (Current Channel A)
//6 AP_NOLOADA Set to 1 to enable an interrupt when the active power no-load condition is detected on Current Channel A
//7 VAR_NOLOADA Set to 1 to enable an interrupt when the reactive power no-load condition is detected on Current Channel A
//8 VA_NOLOADA Set to 1 to enable an interrupt when the apparent power no-load condition is detected on Current Channel A
//9 APSIGN_A Set to 1 to enable an interrupt when the sign of active energy has changed (Current Channel A)
//10 VARSIGN_A Set to 1 to enable an interrupt when the sign of reactive energy has changed (Current Channel A)
//11 ZXTO_IA Set to 1 to enable an interrupt when the zero crossing has been missing on Current Channel A for the length of time specified in the ZXTOUT register
//12 ZXIA Set to 1 to enable an interrupt when the current Channel A zero crossing occurs
//13 OIA Set to 1 to enable an interrupt when the current Channel A peak has exceeded the overcurrent threshold set in the OILVL register
//14 ZXTO Set to 1 to enable an interrupt when a zero crossing has been missing on the voltage channel for the length of time specified in the ZXTOUT register
//15 ZXV Set to 1 to enable an interrupt when the voltage channel zero crossing occurs
//16 OV Set to 1 to enable an interrupt when the voltage peak has exceeded the overvoltage threshold set in the OVLVL register
//17 WSMP Set to 1 to enable an interrupt when new waveform data is acquired
//18 CYCEND Set to 1 to enable an interrupt when it is the end of a line cycle accumulation period
//19 Sag Set to 1 to enable an interrupt when a sag event has occurred
//20 Reset This interrupt is always enabled and cannot be disabled
//21 CRC Set to 1 to enable an interrupt when the checksum has changed

//IRQSTATA Register (Address 0x22D and Address 0x32D) and RSTIRQSTATA Register (Address 0x22E and Address 0x32E)
//Bits Bit Name Description
//0 AEHFA Set to 1 when the active energy register is half full (Current Channel A)
//1 VAREHFA Set to 1 when the reactive energy register is half full (Current Channel A)
//2 VAEHFA Set to 1 when the apparent energy register is half full (Current Channel A)
//3 AEOFA Set to 1 when the active energy register has overflowed or underflowed (Current Channel A)
//4 VAREOFA Set to 1 when the reactive energy register has overflowed or underflowed (Current Channel A)
//5 VAEOFA Set to 1 when the apparent energy register has overflowed or underflowed (Current Channel A)
//6 AP_NOLOADA Set to 1 when the active power no-load condition is detected Current Channel A
//7 VAR_NOLOADA Set to 1 when the reactive power no-load condition is detected Current Channel A
//8 VA_NOLOADA Set to 1 when the apparent power no-load condition is detected Current Channel A
//9 APSIGN_A Set to 1 when the sign of active energy has changed (Current Channel A)
//10 VARSIGN_A Set to 1 when the sign of reactive energy has changed (Current Channel A)
//11 ZXTO_IA Set to 1 when a zero crossing has been missing on Current Channel A for the length of time specified in the ZXTOUT register
//12 ZXIA Set to 1 when a current Channel A zero crossing is detected
//13 OIA Set to 1 when the current Channel A peak has exceeded the overcurrent threshold set in the OILVL register
//14 ZXTO Set to 1 when a zero crossing has been missing on the voltage channel for the length of time specified in the ZXTOUT register
//15 ZXV Set to 1 when the voltage channel zero crossing is detected
//16 OV Set to 1 when the voltage peak has exceeded the overvoltage threshold set in the OVLVL register
//17 WSMP Set to 1 when new waveform data is acquired
//18 CYCEND Set to 1 at the end of a line cycle accumulation period
//19 Sag Set to 1 when a sag event has occurred
//20 Reset Set to 1 at the end of a software or hardware reset
//21 CRC Set to 1 when the checksum has changed

//IRQENB Register (Address 0x22F and Address 0x32F)
//Bits Bit Name Description
//0 AEHFB Set to 1 to enable an interrupt when the active energy is half full (Current Channel B)
//1 VAREHFB Set to 1 to enable an interrupt when the reactive energy is half full (Current Channel B)
//2 VAEHFB Set to 1 to enable an interrupt when the apparent energy is half full (Current Channel B)
//3 AEOFB Set to 1 to enable an interrupt when the active energy has overflowed or underflowed (Current Channel B)
//4 VAREOFB Set to 1 to enable an interrupt when the reactive energy has overflowed or underflowed (Current Channel B)
//5 VAEOFB Set to 1 to enable an interrupt when the apparent energy has overflowed or underflowed (Current Channel B)
//6 AP_NOLOADB Set to 1 to enable an interrupt when the active power no-load detection on Current Channel B occurs
//7 VAR_NOLOADB Set to 1 to enable an interrupt when the reactive power no-load detection on Current Channel B occurs
//8 VA_NOLOADB Set to 1 to enable an interrupt when the apparent power no-load detection on Current Channel B occurs
//9 APSIGN_B Set to 1 to enable an interrupt when the sign of active energy has changed (Current Channel B)
//10 VARSIGN_B Set to 1 to enable an interrupt when the sign of reactive energy has changed (Current Channel B)
//11 ZXTO_IB Set to 1 to enable an interrupt when a zero crossing has been missing on Current Channel B for the length of time specified in the ZXTOUT register
//12 ZXIB Set to 1 to enable an interrupt when the current Channel B zero crossing occurs
//13 OIB Set to 1 to enable an interrupt when the current Channel B peak has exceeded the overcurrent threshold set in the OILVL register

//IRQSTATB Register (Address 0x230 and Address 0x330) and RSTIRQSTATB Register (Address 0x231 and Address 0x331)
//Bits Bit Name Description
//0 AEHFB Set to 1 when the active energy register is half full (Current Channel B)
//1 VAREHFB Set to 1 when the reactive energy register is half full (Current Channel B)
//2 VAEHFB Set to 1 when the apparent energy register is half full (Current Channel B)
//3 AEOFB Set to 1 when the active energy register has overflowed or underflowed (Current Channel B)
//4 VAREOFB Set to 1 when the reactive energy register has overflowed or underflowed (Current Channel B)
//5 VAEOFB Set to 1 when the apparent energy register has overflowed or underflowed (Current Channel B)
//6 AP_NOLOADB Set to 1 when the active power no-load condition is detected on Current Channel B
//7 VAR_NOLOADB Set to 1 when the reactive power no-load condition is detected on Current Channel B
//8 VA_NOLOADB Set to 1 when the apparent power no-load condition is detected on Current Channel B
//9 APSIGN_B Set to 1 when the sign of active energy has changed (Current Channel B)
//10 VARSIGN_B Set to 1 when the sign of reactive energy has changed (Current Channel B)
//11 ZXTO_IB Set to 1 when a zero crossing has been missing on Current Channel B for the length of time specified in the ZXTOUT register
//12 ZXIB Set to 1 when a current Channel B zero crossing is obtained
//13 OIB Set to 1 when current Channel B peak has exceeded the overcurrent threshold set in the OILVL register


