CalPlug/ADE7953-Wattmeter/library/ESP32_SPI/ADE7953ESP32/ADE7953ESP32.cpp
//*******************************************************************************************


//****************User Program Functions*****************


uint8_t ADE7953::getVersion(){
  return spiAlgorithm8_read(functionBitVal(Version_8,1), functionBitVal(Version_8,0));  //An example of the address lookup - the spiAlgorithm8_read((functionBitVal(addr,1), functionBitVal(addr,1)) would return the eqiv. to spiAlgorithm8_read(0x07,0x02) when working properly
}

float ADE7953::getPowerFactorA(){  
	int16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(PFA_16,1)),(functionBitVal(PFA_16,0))); 
	float decimal = decimalize(value, getPowerFactorA_m, getPowerFactorA_b);
return abs(decimal);
  }     
  
float ADE7953::getPowerFactorB(){  
	int16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(PFB_16,1)),(functionBitVal(PFB_16,0))); 
	float decimal = decimalize(value, getPowerFactorA_m, getPowerFactorA_b);
return abs(decimal);
  }   

int16_t ADE7953::getPhaseCalibA(){  
	int16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(PHCALA_16,1)),(functionBitVal(PHCALA_16,0))); 
return value;
  }   
  
int16_t ADE7953::getPhaseCalibB(){  
	int16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(PHCALB_16,1)),(functionBitVal(PHCALB_16,0))); 
return value;
  }   

float ADE7953::getPeriod(){  
	uint16_t value=0;  
	value=spiAlgorithm16_read((functionBitVal(Period_16,1)),(functionBitVal(Period_16,0))); 
	float decimal = decimalize(value, getPeriod_m, getPeriod_b);
return decimal;
  }

unsigned long ADE7953::getAPNOLOAD(){  //use signed long for signed registers, and unsigned long for unsigned registers
	unsigned long value=0;  //use signed long for signed registers, and unsigned long for unsigned registers
	value=spiAlgorithm32_read((functionBitVal(AP_NOLOAD_32,1)),(functionBitVal(AP_NOLOAD_32,0))); //Call MSB and LSB from the register constant (template for how all functions should be called)
return value;
  }
  
long ADE7953::getInstVoltage(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(V_32,1)),(functionBitVal(V_32,0)));
return value;
  }
  
float ADE7953::getVrms(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(VRMS_32,1)),(functionBitVal(VRMS_32,0)));
	float decimal = decimalize(value, getVrms_m, getVrms_b);
return decimal;
  }  
  
long ADE7953::getInstCurrentA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IA_32,1)),(functionBitVal(IA_32,0))); 
return value;
  }
  
long ADE7953::getInstCurrentB(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IB_32,1)),(functionBitVal(IB_32,0))); 
return value;
  }
  
float ADE7953::getIrmsA(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IRMSA_32,1)),(functionBitVal(IRMSA_32,0))); 
	float decimal = decimalize(value, getIrmsA_m, getIrmsA_b);
return decimal;
  }
  
float ADE7953::getIrmsB(){
	unsigned long value=0;
	value=spiAlgorithm32_read((functionBitVal(IRMSB_32,1)), (functionBitVal(IRMSB_32, 0)));
	float decimal = decimalize(value, getIrmsB_m, getIrmsB_b);
return decimal;
	}
  
unsigned long ADE7953::getVpeak(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(VPEAK_32,1)),(functionBitVal(VPEAK_32,0))); 
return value;
  }

unsigned long ADE7953::getIpeakA(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IAPEAK_32,1)),(functionBitVal(IAPEAK_32,0))); 
return value;
  }
  
unsigned long ADE7953::getIpeakB(){  
	unsigned long value=0;  
	value=spiAlgorithm32_read((functionBitVal(IBPEAK_32,1)),(functionBitVal(IBPEAK_32,0))); 
return value;
  }

long ADE7953::getActiveEnergyA(){  
	long value=0; 
	value=spiAlgorithm32_read((functionBitVal(AENERGYA_32,1)),(functionBitVal(AENERGYA_32,0))); 
return value;
  }
  
long ADE7953::getActiveEnergyB(){  
	long value=0; 
	value=spiAlgorithm32_read((functionBitVal(AENERGYB_32,1)),(functionBitVal(AENERGYB_32,0))); 
return value;
  }
  
long ADE7953::getReactiveEnergyA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(RENERGYA_32,1)),(functionBitVal(RENERGYA_32,0))); 
return value;
  }
  
long ADE7953::getReactiveEnergyB(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(RENERGYB_32,1)),(functionBitVal(RENERGYB_32,0))); 
return value;
  }

long ADE7953::getApparentEnergyA(){ 
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(APENERGYA_32,1)),(functionBitVal(APENERGYA_32,0))); 
return value;
  }
  
long ADE7953::getApparentEnergyB(){ 
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(APENERGYB_32,1)),(functionBitVal(APENERGYB_32,0))); 
return value;
  }
    
float ADE7953::getInstApparentPowerA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AVA_32,1)),(functionBitVal(AVA_32,0))); 
	float decimal = decimalize(value, getInstApparentPowerA_m, getInstApparentPowerA_b);
return abs(decimal);
  }
  
float ADE7953::getInstApparentPowerB(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AVB_32,1)),(functionBitVal(AVB_32,0))); 
	float decimal = decimalize(value, getInstApparentPowerB_m, getInstApparentPowerB_b);
return abs(decimal);
  }
  
float ADE7953::getInstActivePowerA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AWATT_32,1)),(functionBitVal(AWATT_32,0))); 
	float decimal = decimalize(value, getInstActivePowerA_m, getInstActivePowerA_b);
return abs(decimal);
  }
  
float ADE7953::getInstActivePowerB(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(BWATT_32,1)),(functionBitVal(BWATT_32,0))); 
	float decimal = decimalize(value, getInstActivePowerB_m, getInstActivePowerB_b);
return abs(decimal);
  }
  
float ADE7953::getInstReactivePowerA(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(AVAR_32,1)),(functionBitVal(AVAR_32,0))); 
	float decimal = decimalize(value, getInstReactivePowerA_m, getInstReactivePowerA_b);
return decimal;
  }
  
float ADE7953::getInstReactivePowerB(){  
	long value=0;  
	value=spiAlgorithm32_read((functionBitVal(BVAR_32,1)),(functionBitVal(BVAR_32,0))); 
	float decimal = decimalize(value, getInstReactivePowerB_m, getInstReactivePowerB_b);
return decimal;
  }
  
  //Note:  The easiest way to quickly measure power is: P(real_rms)=V(rms)*I(rms)*PF, the alternate is to accumulate energy and time average
  
//*******************************************************


//****************ADE 7953 Library Control Functions**************************************

//****************Object Definition*****************
ADE7953::ADE7953(int SS, int SPI_freq)  //set SPI frequency and SS pin designation
{
  _SS=SS;
  _SPI_freq=SPI_freq;
  }
//**************************************************

//****************Initialization********************
void ADE7953::initialize(){
    
  #ifdef ADE7953_VERBOSE_DEBUG
   Serial.print("ADE7953:initialize function started "); 
  #endif

  spy = spiStartBus(VSPI, SPI_CLOCK_DIV16, SPI_MODE3, SPI_MSBFIRST);
  spiAttachSCK(spy, -1);
  spiAttachMOSI(spy, -1);
  spiAttachMISO(spy, -1);
  pinMode(_SS, OUTPUT);
  digitalWrite(_SS, HIGH);
  delay(50);
  digitalWrite(_SS, LOW); //Enable data transfer by bringing SS line LOW
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xFE);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0xAD);       
  spiTransferByte(spy, 0x01);
  spiTransferByte(spy, 0x20);
  spiTransferByte(spy, WRITE);
  spiTransferByte(spy, 0x00);
  spiTransferByte(spy, 0x30);  
  digitalWrite(_SS, HIGH); //Disable data transfer by bringing SS line HIGH
  spiStopBus(spy);

